musicconcert/app/views/concerts/new.html.erb

	<%= f.label :city_id, "City" %>
	<%= f.collection_select(:city_id, City.all, :id, :city_name) %>
---
SELECT "cities".* FROM "cities"