musicconcert/app/views/concerts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."concert_id" = $1  [["concert_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."concert_id" = $1  [["concert_id", 2]]
---
<div class="comments">
	<h2>Comments (<%= @concert.comments.size %>)</h2>