musicconcert/app/controllers/concerts_controller.rb

	def index
		@concerts = Concert.all
		#@concert_today = Concert.find_by(date: Date.today)
		@concerts_today = Concert.where(date: Date.today)
---
SELECT "concerts".* FROM "concerts" WHERE (date > '2015-05-02' AND date < '2015-06-01')
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."date" = $1 LIMIT 1  [["date", "2015-05-01"]]

	def show
		@concert = Concert.find params[:id]
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT 1  [["id", 1]]

	def filter_concerts_price
		@results = Concert.where('price < ? AND date > ?', params[:price_budget], Date.today)
---
SELECT "concerts".* FROM "concerts" WHERE (date > '2015-05-01') AND (price < '50')

	def popular
		@concerts_future = Concert.where('date > ?', Date.today)
		@concerts_popular = Concert.order_by_comments_size(5)
---
SELECT "concerts".* FROM "concerts" WHERE (date > '2015-05-01')
SELECT  "concerts".* FROM "concerts"  ORDER BY "concerts"."id" ASC LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."concert_id" = $1  [["concert_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."concert_id" = $1  [["concert_id", 2]]

	def create
		@concert = Concert.new concert_params
		if @concert.save
---
INSERT INTO "concerts" ("band", "city_id", "venue", "date", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def add_comment
		@concert = Concert.find params[:id]
		@concert.comments.create comment_text: params[:comment_text]['text']
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("comment_text", "concert_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment_text", "testing testing"], ["concert_id", 2], ["created_at", "2015-05-01 10:45:04.595876"], ["updated_at", "2015-05-01 10:45:04.595876"]]